Plante/app/views/admin/data_cards/index.html.erb

				<td>
					<% unless y.control_card_id.blank? %>
---
SELECT `data_cards`.* FROM `data_cards`