Plante/app/views/pages/show_data.html.erb

SELECT `values`.* FROM `values` WHERE (data_card_id in (6) AND value_type_id = 5)
---
		<% @value_types.collect(&:name).each do |v|%>
		<div id="<%= v %>-value" data-source="<%=  ( ["#{VALUE_TYPES[:"#{v}"][0]}"] + instance_variable_get("@#{v}_values").collect{ |y| y.value}).join('!')  %>"></div>