Plante/app/controllers/pages_controller.rb

SELECT `data_cards`.* FROM `data_cards` WHERE `data_cards`.`greenhouse_id` = 1
SELECT `target_values`.* FROM `target_values` WHERE (greenhouse_id = 2 AND value_type_id = 5 AND active = 1)
SELECT `values`.* FROM `values` WHERE (data_card_id in (4))
---
	def show_current_state
		unless params[:selected_greenhouse].blank?
			@selected_greenhouse = Greenhouse.find(params[:selected_greenhouse])
		else
			@selected_greenhouse = Greenhouse.find(@greenhouses[0].id) unless @greenhouses.blank?
		end

		@value_types_header = ['Type de valeur','Valeur','Valeur cible']

		unless @selected_greenhouse.blank?
			@linked_data_cards = DataCard.where(greenhouse_id: @selected_greenhouse.id)
			@value_types.each do |g|
				instance_variable_set("@target_#{g.name}", TargetValue.where("greenhouse_id = ? AND value_type_id = ? AND active = ?", @selected_greenhouse.id, g.id, true)[0].value)

SELECT `target_values`.* FROM `target_values` WHERE (greenhouse_id = 2 AND value_type_id = 5 AND active = 1)
---
	def show_parameters
		unless params[:selected_greenhouse].blank?
			@selected_greenhouse = Greenhouse.find(params[:selected_greenhouse])
		else
			@selected_greenhouse = Greenhouse.find(@greenhouses[0].id) unless @greenhouses.blank?
		end

		unless @selected_greenhouse.blank?
			@value_types.each do |g|
				target = TargetValue.where("greenhouse_id = ? AND value_type_id = ? AND active = ?", @selected_greenhouse.id, g.id, true)[0]

SELECT `target_values`.* FROM `target_values` WHERE (greenhouse_id = '2' AND value_type_id = '5' AND active = 1)
SELECT  `value_types`.* FROM `value_types` WHERE `value_types`.`id` = 5 LIMIT 1
INSERT INTO `target_values` (`value`, `active`, `user_id`, `value_type_id`, `created_at`, `greenhouse_id`, `deactivated_at`) VALUES (20.0, 0, 1, 5, '2016-04-14 17:18:32', 2, '2016-04-15 11:26:09')
UPDATE `target_values` SET `value` = 12.0, `created_at` = '2016-04-14 17:05:43', `active` = 1, `user_id` = 1 WHERE `target_values`.`id` = 1
---
	def update_parameters
		#On met la target value modifiée a false + deactivated at à Time.now
		#On crée une nouvelle valeur ensuite
		old_target = TargetValue.where("greenhouse_id = ? AND value_type_id = ? AND active = ?", params[:greenhouse_id], params[:value_type_id], true)[0]
		value_type = ValueType.find(params[:value_type_id])

		new_value = params[:"#{value_type.name}_value"]

		begin
		ActiveRecord::Base.transaction do
			new_target = TargetValue.create(old_target.attributes.except("id"))
			new_target.update_attributes(value: new_value, created_at: Time.now, active: true, user_id: current_user.id)

SELECT `data_cards`.* FROM `data_cards` WHERE `data_cards`.`greenhouse_id` = 2
SELECT  `target_values`.* FROM `target_values` WHERE (greenhouse_id = 2 AND value_type_id = 5 AND created_at < '2016-04-15 13:33:02.000000' AND deactivated_at > '2016-04-15 13:33:02.000000')  ORDER BY `target_values`.`id` ASC LIMIT 1
SELECT  `target_values`.* FROM `target_values` WHERE (greenhouse_id = 2 AND value_type_id = 5 AND active = 1)  ORDER BY `target_values`.`id` ASC LIMIT 1
SELECT `values`.* FROM `values` WHERE (data_card_id in (6) AND value_type_id = 5)
---
	def show_data
		unless params[:selected_greenhouse].blank?
			@selected_greenhouse = Greenhouse.find(params[:selected_greenhouse])
		else
			@selected_greenhouse = Greenhouse.find(@greenhouses[0].id) unless @greenhouses.blank?
		end

		unless @selected_greenhouse.blank?
			@linked_data_cards = DataCard.where(greenhouse_id: @selected_greenhouse.id)
			@hash_target_values = Hash.new
			@value_types.each do |g|
				max_deactivated_at = TargetValue.where('greenhouse_id = ? AND value_type_id = ?',@selected_greenhouse.id,g.id).order('deactivated_at DESC').first.deactivated_at
				all_values = Value.where("data_card_id in (?) AND value_type_id = ?", @linked_data_cards.collect(&:id),g.id)