Plante/app/controllers/tests_controller.rb

SELECT `value_types`.* FROM `value_types`
SELECT `target_values`.* FROM `target_values` WHERE (greenhouse_id = 2 AND active = 1)
---
	def create
		case params[:request_type]
			when 'get_value_types'
				f = Logger.new("log/http_request_supervision.log")
				f.info ""
				f.info "######## STARTING get_value_types ########"
				f.info ""

				greenhouse_id = Greenhouse.where(serial_nbr: params[:greenhouse_serial_nbr]).first.id
				@result = ValueType.all
				respond_to do |format|
					format.xml{render xml: @result}
				end
				f.info "Answer sent"

			#Envoie à la serre les target value
			when "get_target_value"
				f = Logger.new("log/http_request_supervision.log")
				f.info ""
				f.info "######## Starting get_target_value  ########"
				greenhouse_id = Greenhouse.where(serial_nbr: params[:greenhouse_serial_nbr]).first.id
				@result = TargetValue.where("greenhouse_id = ? AND active = ?", greenhouse_id.to_i, true)