Plante/app/controllers/admin/control_cards_controller.rb

SELECT `control_cards`.* FROM `control_cards`
---
	def index
		@all_control_cards = ControlCard.all

SELECT  `control_cards`.* FROM `control_cards` WHERE `control_cards`.`school_id` = 1 LIMIT 1
SELECT `schools`.* FROM `schools`
---
	def new
		@control_card = ControlCard.new
		@linkable_schools = School.all.select{|y| y.control_card.blank? == true}

INSERT INTO `control_cards` (`serial_nbr`, `school_id`) VALUES ('qsdf', 1)
---
	def create
		@control_card = ControlCard.new(control_card_params)
		if @control_card.save

SELECT `control_cards`.* FROM `control_cards` WHERE `control_cards`.`id` = 1
DELETE FROM `control_cards` WHERE `control_cards`.`id` = 1
---
	def destroy
		@control_card = ControlCard.where(id: params[:id])[0]
		if @control_card.destroy

SELECT `control_cards`.* FROM `control_cards` WHERE `control_cards`.`id` = 1
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1
---
	def show
		@control_card = ControlCard.where(id: params[:id].to_i)[0]
		unless @control_card.school.blank?