Plante/app/controllers/admin/data_cards_controller.rb

	def index
		@all_data_cards = DataCard.all
---
SELECT `data_cards`.* FROM `data_cards`

	def new
		@data_card = DataCard.new
		@linkable_control_cards = ControlCard.all
---
SELECT `control_cards`.* FROM `control_cards`

	def create
		@data_card = DataCard.new(data_card_params)
		if @data_card.save
---
INSERT INTO `data_cards` (`serial_nbr`, `control_card_id`, `greenhouse_id`) VALUES ('wxcv', 1, 1)

	def edit
		@data_card = DataCard.where(id: params[:id])[0]
		@linkable_control_cards = ControlCard.all
		@linkable_greenhouses = Greenhouse.all.select{|t| t.data_card.count < 4}
		@blank_included = false || true if !@data_card.control_card.blank?
		@blank_included2 = false || true if !@data_card.greenhouse.blank?
---
SELECT `data_cards`.* FROM `data_cards` WHERE `data_cards`.`id` = 2
SELECT `control_cards`.* FROM `control_cards`
SELECT COUNT(*) FROM `data_cards` WHERE `data_cards`.`greenhouse_id` = 1
SELECT  `control_cards`.* FROM `control_cards` WHERE `control_cards`.`id` = 1 LIMIT 1
SELECT  `greenhouses`.* FROM `greenhouses` WHERE `greenhouses`.`id` = 1 LIMIT 1

	def update
		@data_card = DataCard.where(id: params[:id].to_i)[0]
		if @data_card.update_attributes(data_card_params)
---
SELECT `data_cards`.* FROM `data_cards` WHERE `data_cards`.`id` = 2
UPDATE `data_cards` SET `greenhouse_id` = NULL WHERE `data_cards`.`id` = 2

	def destroy
		@data_card = DataCard.where(id: params[:id])[0]
		if @data_card.destroy
---
SELECT `data_cards`.* FROM `data_cards` WHERE `data_cards`.`id` = 2
DELETE FROM `data_cards` WHERE `data_cards`.`id` = 2

	def show
		@data_card = DataCard.where(id: params[:id].to_i)[0]
---
SELECT `data_cards`.* FROM `data_cards` WHERE `data_cards`.`id` = 1