Plante/app/controllers/admin/greenhouses_controller.rb

	def new
		@greenhouse = Greenhouse.new
		@linkable_schools = School.all
---
SELECT `schools`.* FROM `schools`

	def create
		greenhouse = Greenhouse.new(greenhouse_params)
		if greenhouse.save
			ValueType.all.each do |v|
				TargetValue.create(greenhouse_id: greenhouse.id, value_type_id: v.id)
---
INSERT INTO `greenhouses` (`serial_nbr`, `school_id`, `created_at`, `updated_at`) VALUES ('azer', 1, '2016-04-14 15:52:15', '2016-04-14 15:52:15')
SELECT `value_types`.* FROM `value_types`
INSERT INTO `target_values` (`greenhouse_id`, `value_type_id`, `created_at`) VALUES (2, 5, '2016-04-14 15:52:15')

	def edit
		@greenhouse = Greenhouse.where(id: params[:id])[0]
		@linkable_schools = School.all
---
SELECT `schools`.* FROM `schools`

	def update
		@greenhouse = Greenhouse.where(id: params[:id].to_i)[0]
		if @greenhouse.update_attributes(greenhouse_params)
---
UPDATE `greenhouses` SET `school_id` = 1, `updated_at` = '2016-04-14 15:03:16' WHERE `greenhouses`.`id` = 1

	def destroy
		@greenhouse = Greenhouse.where(id: params[:id])[0]
		if @greenhouse.destroy
---
DELETE FROM `greenhouses` WHERE `greenhouses`.`id` = 1