Plante/app/controllers/admin/schools_controller.rb

SELECT `schools`.* FROM `schools`
---
	def index
		@all_schools = School.all

INSERT INTO `schools` (`name`, `adress`, `town`, `zip_code`, `contact`, `phone_number`, `email`) VALUES ('Yves du Manoir', 'rue des jardins', 'Vaucresson', '92420', '', '', '')
---
	def create
		@school = School.new(school_params)
		if @school.save

SELECT `schools`.* FROM `schools` WHERE `schools`.`id` = 1
SELECT  `control_cards`.* FROM `control_cards` WHERE `control_cards`.`school_id` = 1 LIMIT 1
---
	def show
		@school = School.where(id: params[:id].to_i)[0]
		unless @school.control_card.blank?