Plante/app/views/admin/control_cards/index.html.erb

				<td>
						<% unless y.school.blank? %>
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1